shutil #파일을 복사 하거나 이동할때 사용하는 기능이다

glob #특정 디렉털의 있는 파일이름 모두를 알아야 할 때 사용하는 모듈이다

pickle #객체의 형태를 그대로 유지하면서 파일에 저장하고 불러올 수 있게 하는 모듈이다

os #환경 변수나 디렉터리,파일 등의 os자원을 제어할 수 있게 해 주는 모듈이다

zipfile #여러개의 파일을 zipㅁ형식으로 합치거나 이를 해제할때 사용하는 모듈이다

threadong #컴퓨터에서 동작하고 있는 프로그램을 프로세스라고 한다 보통 1개의 프로세스는 1가지 일만 하지만 스레드를 사용하면 2가지 이상의  일을 동시에 수행할 수 있다

tempfile #파일을 임시로 만들어서 사용할ㄷ 때 유용한 모듈이다

traceback #프로그램 실행 중 발생한 오류를 추적하고 할 때 사용하는 모듈이다

json #JSON데이터를 쉽게 처리하고자 사용하는 모듈이다

urllib #url을 읽고 분삭힐 때 사용하는 모듈이다

webbrowser #파이썬 프로그랭에서 시스템 브라우저를 호출할 때 사용하는 모듈이다
