abs() # 입력받은 숫자의 절대값을 리턴하는 함수이다.

all() #반복 가능한 데이터 x를 입력값으로 받으며 그 요소가 모두 참이면 true 하나라도 거짓이면 false를 리턴한다

any() #반복 가능한 데이터 x를 입력으로 받아 그 요소중 하나라도 참이면 true 모두 거짓이면 false를 리턴한다 

chr() #유니 코드 숫자값을 입력받아 그 코드에 해당하는 문자를 리턴하는 함수이다

dir() #객체가 지닌 변수나 함수를 보여주는 함수이다

divmod() #2개의 숫자를 입력으로 받고 그 둘을 나눈 몫과 나머지를 튜플로 리턴한다

enumerate() #"열거하다" 라는 뜻이다 순서가 있는 데이터를 입력으로 받아 인뎃스 값을 포함하는 객체를 리턴한다.

eval() #문자열로 구성된 표현식을 입력으로 받아 해당 문자열을 실행한 결과값을 리턴하는 함수이다.

filter() #"무엇인가를 걸러 낸다"라는 뜻으로 반복가능한 데이터를 받았을때 리턴값이 참인 것만 리턴하는 함수이다.

hex() #정수를 입력받아 16진수 문자열로 변환하여 리턴하는 함수이다.

id() #객체를 입력받아 객체의 고유 주솟값을 리턴하는 함수 이다.

Input() #사용자 입력을 받는 함수이다.

int() #문지얄 형태의 숫자나 소수점이 이는 숫자를 정수로 리턴하는 함수이다.

isinstance() #순서대로 객체와 클래스를 인수로 받아 입력받은 객체가 클래스의 인스턴스인지를 판단하여 참,거짓을 판단하여 리턴한다

len() #입력값의 길이를 리턴하는 함수이다

list() #반복 가능한 데이터를 입력받아 리스트로 만들어 리턴하는 함수이다.

map() #함수와 반복 가능한 데이터를 입력으로 받는다 입력받은 데이터의 각 요소에 함수를 적용한 결과를 리턴한다.

max() #인수로 반복 가능한 데이터를 입력받아 그 최대값을 리턴하는 함수이다

min() #반대로 반복가능한 데이터를 입력받아 그 최솟값을 리턴하는 함수이다

oct() #정수를 8진수 문자열로 바꾸어 리턴하는 함수 이다.

open() #파일 이름과 읽기방법을 입력받아 파일 객체를 리턴하는 함수이다 이때 읽기방법을 생략하면 기본 값인 읽기 모드로 리턴한다

ord() #문자의 유니코드 숫자값을 리턴하는 함수이다

pow() #두 값을 제곱한 결과값을 리턴하는 함수이다

range() #입력받은 숫자에 해당하는 범위 값을 반복가능한 객체로 만들어 리턴한다

round() #숫자를 입력받아 반올림해 리턴하는 함수이다

sorted() #입력데이터를 정렬한 후 그 결과를 리스트로 리턴하는 함수이다

str() #문자열 형태로 객체를 변환하여 리턴하는 함수이다

sum() #입력 데이터의 합을 리턴하는 함수이다

tuple() #반복 가능한 데이터를 튜플로 바꾸어 리턴하는 함수이다 만약 입력이 튜플이면 그대로 리턴한다

type() #입력값의 자료형이 무엇인지 알려주는 함수이다 

zip() #동일한 개수로 ㅇ루어진 데이터들을 묶어서 리턴한느 함수이다

#위 내장함수들은 활용빈도가 높고 중요한 함수를 중심으로 알파벳 순서대로 간략히 정리한 것들이다

